=== Command: yosys synth_alu8bit.ys 2>&1 | tee synth_alu8bit.log (2026-02-19T22:12:56.757Z) ===
Exit Code: 0
Output:

 /----------------------------------------------------------------------------\
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |  Copyright (C) 2012 - 2026  Claire Xenia Wolf <claire@yosyshq.com>         |
 |  Distributed under an ISC-like license, type "license" to see terms        |
 \----------------------------------------------------------------------------/
 Yosys 0.62 (git sha1 7326bb7d6641500ecb285c291a54a662cb1e76cf, clang++ 17.0.0 -fPIC -O3)

-- Executing script file `synth_alu8bit.ys' --
echo on

yosys> read_verilog alu8bit.v

1. Executing Verilog-2005 frontend: alu8bit.v
Parsing Verilog input from `alu8bit.v' to AST representation.
Generating RTLIL representation for module `\alu8bit'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top alu8bit

2. Executing HIERARCHY pass (managing design hierarchy).

2.1. Analyzing design hierarchy..
Top module:  \alu8bit

2.2. Analyzing design hierarchy..
Top module:  \alu8bit
Removed 0 unused modules.

yosys> proc

3. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Marked 2 switch rules as full_case in process $proc$alu8bit.v:28$1 in module alu8bit.
Removed a total of 0 dead cases.

yosys> proc_prune

3.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 3 assignments to connections.

yosys> proc_init

3.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.
<suppressed ~2 debug messages>

yosys> proc_mux

3.7. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `\alu8bit.$proc$alu8bit.v:28$1'.
     1/6: $2\cout[0:0]
     2/6: $2\out[7:0]
     3/6: $2\temp_result[8:0]
     4/6: $1\temp_result[8:0]
     5/6: $1\cout[0:0]
     6/6: $1\out[7:0]

yosys> proc_dlatch

3.8. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `\alu8bit.\out' from process `\alu8bit.$proc$alu8bit.v:28$1'.
No latch inferred for signal `\alu8bit.\cout' from process `\alu8bit.$proc$alu8bit.v:28$1'.
No latch inferred for signal `\alu8bit.\temp_result' from process `\alu8bit.$proc$alu8bit.v:28$1'.

yosys> proc_dff

3.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 2 empty switches in `\alu8bit.$proc$alu8bit.v:28$1'.
Removing empty process `alu8bit.$proc$alu8bit.v:28$1'.
Cleaned up 2 empty switches.

yosys> opt_expr -keepdc

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.
<suppressed ~5 debug messages>

yosys> opt

4. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.

yosys> opt_merge -nomux

4.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 33 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 25 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_muxtree

4.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 2/2 on $mux $procmux$20.
    dead port 1/3 on $pmux $procmux$47.
    dead port 2/3 on $pmux $procmux$47.
    dead port 3/3 on $pmux $procmux$47.
    dead port 2/2 on $mux $procmux$35.
    dead port 1/2 on $mux $procmux$50.
    dead port 2/2 on $mux $procmux$50.
    dead port 1/2 on $mux $procmux$53.
    dead port 2/2 on $mux $procmux$53.
Removed 9 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

4.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \alu8bit.
    New ctrl vector for $pmux cell $procmux$24: { $procmux$49_CMP $procmux$48_CMP $procmux$32_CMP $procmux$31_CMP $procmux$30_CMP $procmux$29_CMP $procmux$27_CMP $auto$opt_reduce.cc:137:opt_pmux$62 $procmux$25_CMP }
    New ctrl vector for $pmux cell $procmux$13: { $procmux$49_CMP $procmux$48_CMP $auto$opt_reduce.cc:137:opt_pmux$66 $auto$opt_reduce.cc:137:opt_pmux$64 }
  Optimizing cells in module \alu8bit.
Performed a total of 2 changes.

yosys> opt_merge

4.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 23 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 22 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff

4.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..
Removed 0 unused cells and 35 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

4.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.

4.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

4.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \alu8bit.
Performed a total of 0 changes.

yosys> opt_merge

4.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 22 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Removed a total of 0 cells.

yosys> opt_dff

4.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..

yosys> opt_expr

4.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.

4.16. Finished fast OPT passes. (There is nothing left to do.)

yosys> memory

5. Executing MEMORY pass.

yosys> opt_mem

5.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

5.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

5.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

5.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

5.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

5.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..

yosys> memory_share

5.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

5.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

5.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..

yosys> memory_collect

5.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> memory_map

5.11. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> techmap

6. Executing TECHMAP pass (map to technology primitives).

6.1. Executing Verilog-2005 frontend: /opt/homebrew/bin/../share/yosys/techmap.v
Parsing Verilog input from `/opt/homebrew/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu_brent_kung'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `$__div_mod_u'.
Generating RTLIL representation for module `$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Generating RTLIL representation for module `$connect'.
Generating RTLIL representation for module `$input_port'.
Successfully finished Verilog frontend.

6.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_or.
Running "alumacc" on wrapper $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$add:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Running "alumacc" on wrapper $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using template $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47 for cells of type $extern:wrap:$sub:A_SIGNED=0:A_WIDTH=9:B_SIGNED=0:B_WIDTH=9:Y_WIDTH=9:394426c56d1a028ba8fdd5469b163e04011def47.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using template $paramod$b3b6ac92d800c6f07aa48f510f923d86a674e5a7\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$900ee9ce5f792c04191505d792b35e9409e3f142\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$d2fa05d38998afabc6d4f34471305d0af4b8b2df\_90_alu for cells of type $alu.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000001001 for cells of type $fa.
Using template $paramod\_90_lcu_brent_kung\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~475 debug messages>

yosys> opt

7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.
<suppressed ~132 debug messages>

yosys> opt_merge -nomux

7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 378 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 334 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 325 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
<suppressed ~159 debug messages>
Removed a total of 53 cells.

yosys> opt_muxtree

7.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

7.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \alu8bit.
Performed a total of 0 changes.

yosys> opt_merge

7.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 325 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Removed a total of 0 cells.

yosys> opt_dff

7.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

7.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..
Removed 0 unused cells and 194 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

7.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.

7.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

7.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

7.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \alu8bit.
Performed a total of 0 changes.

yosys> opt_merge

7.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\alu8bit'.
Computing hashes of 325 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Removed a total of 0 cells.

yosys> opt_dff

7.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

7.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \alu8bit..

yosys> opt_expr

7.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module alu8bit.

7.16. Finished fast OPT passes. (There is nothing left to do.)

yosys> clean

yosys> stat

8. Printing statistics.

=== alu8bit ===

        +----------Local Count, excluding submodules.
        | 
      111 wires
      391 wire bits
        6 public wires
       30 public wire bits
        6 ports
       30 port bits
      325 cells
      119   $_AND_
       18   $_MUX_
       32   $_NOT_
      126   $_OR_
       30   $_XOR_


yosys> hierarchy -check

9. Executing HIERARCHY pass (managing design hierarchy).
Attribute `top' found on module `alu8bit'. Setting top module to alu8bit.

9.1. Analyzing design hierarchy..
Top module:  \alu8bit

9.2. Analyzing design hierarchy..
Top module:  \alu8bit
Removed 0 unused modules.

yosys> stat -top alu8bit

10. Printing statistics.

=== alu8bit ===

        +----------Local Count, excluding submodules.
        | 
      111 wires
      391 wire bits
        6 public wires
       30 public wire bits
        6 ports
       30 port bits
      325 cells
      119   $_AND_
       18   $_MUX_
       32   $_NOT_
      126   $_OR_
       30   $_XOR_


yosys> check

11. Executing CHECK pass (checking for obvious problems).
Checking module alu8bit...
Found and reported 0 problems.

yosys> write_verilog -noattr synth_alu8bit_netlist.v

12. Executing Verilog backend.

yosys> bmuxmap

12.1. Executing BMUXMAP pass.

yosys> demuxmap

12.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\alu8bit'.

yosys> write_json synth_alu8bit.json

13. Executing JSON backend.

yosys> show -format dot -prefix synth_alu8bit_diagram -notitle

14. Generating Graphviz representation of design.
Writing dot description to `synth_alu8bit_diagram.dot'.
Dumping module alu8bit to page 1.

yosys> echo ""

Syntax error in command `echo ""':

    echo on

Print all commands to log before executing them.


    echo off

Do not print all commands to log before executing them. (default)

ERROR: Command syntax error: Unexpected argument.
> echo ""
>      ^

=== End Output ===

