
 /----------------------------------------------------------------------------\
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |  Copyright (C) 2012 - 2026  Claire Xenia Wolf <claire@yosyshq.com>         |
 |  Distributed under an ISC-like license, type "license" to see terms        |
 \----------------------------------------------------------------------------/
 Yosys 0.62 (git sha1 7326bb7d6641500ecb285c291a54a662cb1e76cf, clang++ 17.0.0 -fPIC -O3)

-- Executing script file `synth_alu8bit_custom.ys' --
echo on

yosys> read_verilog and_gate4.v

1. Executing Verilog-2005 frontend: and_gate4.v
Parsing Verilog input from `and_gate4.v' to AST representation.
Generating RTLIL representation for module `\and_gate4'.
Successfully finished Verilog frontend.

yosys> read_verilog or_gate4.v

2. Executing Verilog-2005 frontend: or_gate4.v
Parsing Verilog input from `or_gate4.v' to AST representation.
Generating RTLIL representation for module `\or_gate4'.
Successfully finished Verilog frontend.

yosys> read_verilog exor_gate4.v

3. Executing Verilog-2005 frontend: exor_gate4.v
Parsing Verilog input from `exor_gate4.v' to AST representation.
Generating RTLIL representation for module `\exor_gate4'.
Successfully finished Verilog frontend.

yosys> read_verilog not_gate4.v

4. Executing Verilog-2005 frontend: not_gate4.v
Parsing Verilog input from `not_gate4.v' to AST representation.
Generating RTLIL representation for module `\not_gate4'.
Successfully finished Verilog frontend.

yosys> read_verilog add_4bit.v

5. Executing Verilog-2005 frontend: add_4bit.v
Parsing Verilog input from `add_4bit.v' to AST representation.
Generating RTLIL representation for module `\add_4bit'.
Successfully finished Verilog frontend.

yosys> read_verilog add_8bit.v

6. Executing Verilog-2005 frontend: add_8bit.v
Parsing Verilog input from `add_8bit.v' to AST representation.
Generating RTLIL representation for module `\add_8bit'.
Successfully finished Verilog frontend.

yosys> read_verilog and_gate8.v

7. Executing Verilog-2005 frontend: and_gate8.v
Parsing Verilog input from `and_gate8.v' to AST representation.
Generating RTLIL representation for module `\and_gate8'.
Successfully finished Verilog frontend.

yosys> read_verilog or_gate8.v

8. Executing Verilog-2005 frontend: or_gate8.v
Parsing Verilog input from `or_gate8.v' to AST representation.
Generating RTLIL representation for module `\or_gate8'.
Successfully finished Verilog frontend.

yosys> read_verilog exor_gate8.v

9. Executing Verilog-2005 frontend: exor_gate8.v
Parsing Verilog input from `exor_gate8.v' to AST representation.
Generating RTLIL representation for module `\exor_gate8'.
Successfully finished Verilog frontend.

yosys> read_verilog not_gate8.v

10. Executing Verilog-2005 frontend: not_gate8.v
Parsing Verilog input from `not_gate8.v' to AST representation.
Generating RTLIL representation for module `\not_gate8'.
Successfully finished Verilog frontend.

yosys> read_verilog add_subtract_8bit.v

11. Executing Verilog-2005 frontend: add_subtract_8bit.v
Parsing Verilog input from `add_subtract_8bit.v' to AST representation.
Generating RTLIL representation for module `\add_subtract_8bit'.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Warning: wire '\b_in' is assigned in a block at add_subtract_8bit.v:18.4-18.25.
Successfully finished Verilog frontend.

yosys> read_verilog inc_8bit.v

12. Executing Verilog-2005 frontend: inc_8bit.v
Parsing Verilog input from `inc_8bit.v' to AST representation.
Generating RTLIL representation for module `\inc_8bit'.
Successfully finished Verilog frontend.

yosys> read_verilog dec_8bit.v

13. Executing Verilog-2005 frontend: dec_8bit.v
Parsing Verilog input from `dec_8bit.v' to AST representation.
Generating RTLIL representation for module `\dec_8bit'.
Successfully finished Verilog frontend.

yosys> read_verilog sub_8bit.v

14. Executing Verilog-2005 frontend: sub_8bit.v
Parsing Verilog input from `sub_8bit.v' to AST representation.
Generating RTLIL representation for module `\sub_8bit'.
Successfully finished Verilog frontend.

yosys> read_verilog alu8bit_custom.v

15. Executing Verilog-2005 frontend: alu8bit_custom.v
Parsing Verilog input from `alu8bit_custom.v' to AST representation.
Generating RTLIL representation for module `\alu8bit'.
Note: Assuming pure combinatorial block at alu8bit_custom.v:29.2-94.5 in
compliance with IEC 62142(E):2005 / IEEE Std. 1364.1(E):2002. Recommending
use of @* instead of @(...) for better match of synthesis and simulation.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top alu8bit

16. Executing HIERARCHY pass (managing design hierarchy).

16.1. Analyzing design hierarchy..
Top module:  \alu8bit
Used module:     \not_gate8
Used module:         \not_gate4
Used module:     \exor_gate8
Used module:         \exor_gate4
Used module:     \or_gate8
Used module:         \or_gate4
Used module:     \and_gate8
Used module:         \and_gate4
Used module:     \dec_8bit
Used module:         \sub_8bit
Used module:             \add_8bit
Used module:                 \add_4bit
Used module:     \inc_8bit

16.2. Analyzing design hierarchy..
Top module:  \alu8bit
Used module:     \not_gate8
Used module:         \not_gate4
Used module:     \exor_gate8
Used module:         \exor_gate4
Used module:     \or_gate8
Used module:         \or_gate4
Used module:     \and_gate8
Used module:         \and_gate4
Used module:     \dec_8bit
Used module:         \sub_8bit
Used module:             \add_8bit
Used module:                 \add_4bit
Used module:     \inc_8bit
Removing unused module `\add_subtract_8bit'.
Removed 1 unused modules.
Mapping positional arguments of cell sub_8bit.sub_out (add_8bit).
Mapping positional arguments of cell sub_8bit.ones_comp (not_gate8).
Mapping positional arguments of cell dec_8bit.dec (sub_8bit).
Mapping positional arguments of cell inc_8bit.inc_byte (add_8bit).
Mapping positional arguments of cell alu8bit.not_gate (not_gate8).
Mapping positional arguments of cell alu8bit.exor_gate (exor_gate8).
Mapping positional arguments of cell alu8bit.or_gate (or_gate8).
Mapping positional arguments of cell alu8bit.and_gate (and_gate8).
Mapping positional arguments of cell alu8bit.dec (dec_8bit).
Mapping positional arguments of cell alu8bit.inc (inc_8bit).
Mapping positional arguments of cell alu8bit.sub (sub_8bit).
Mapping positional arguments of cell alu8bit.add (add_8bit).
Mapping positional arguments of cell not_gate8.n47 (not_gate4).
Mapping positional arguments of cell not_gate8.n03 (not_gate4).
Mapping positional arguments of cell exor_gate8.x47 (exor_gate4).
Mapping positional arguments of cell exor_gate8.x03 (exor_gate4).
Mapping positional arguments of cell or_gate8.or47 (or_gate4).
Mapping positional arguments of cell or_gate8.or03 (or_gate4).
Mapping positional arguments of cell and_gate8.a47 (and_gate4).
Mapping positional arguments of cell and_gate8.a03 (and_gate4).
Mapping positional arguments of cell add_8bit.add47 (add_4bit).
Mapping positional arguments of cell add_8bit.add03 (add_4bit).
Mapping positional arguments of cell add_4bit.Cprop (exor_gate4).
Mapping positional arguments of cell add_4bit.Cgen (and_gate4).

yosys> proc

17. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

17.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

17.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Marked 3 switch rules as full_case in process $proc$alu8bit_custom.v:29$60 in module alu8bit.
Removed a total of 0 dead cases.

yosys> proc_prune

17.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 2 assignments to connections.

yosys> proc_init

17.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

17.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

17.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.
<suppressed ~3 debug messages>

yosys> proc_mux

17.7. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `\alu8bit.$proc$alu8bit_custom.v:29$60'.
     1/5: $3\out[7:0]
     2/5: $2\cout[0:0]
     3/5: $2\out[7:0]
     4/5: $1\out[7:0]
     5/5: $1\cout[0:0]

yosys> proc_dlatch

17.8. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `\alu8bit.\out' from process `\alu8bit.$proc$alu8bit_custom.v:29$60'.
Latch inferred for signal `\alu8bit.\cout' from process `\alu8bit.$proc$alu8bit_custom.v:29$60': $auto$proc_dlatch.cc:432:proc_dlatch$95

yosys> proc_dff

17.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

17.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

17.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 3 empty switches in `\alu8bit.$proc$alu8bit_custom.v:29$60'.
Removing empty process `alu8bit.$proc$alu8bit_custom.v:29$60'.
Cleaned up 3 empty switches.

yosys> opt_expr -keepdc

17.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module sub_8bit.
Optimizing module dec_8bit.
Optimizing module inc_8bit.
Optimizing module alu8bit.
<suppressed ~13 debug messages>
Optimizing module not_gate8.
Optimizing module exor_gate8.
Optimizing module or_gate8.
Optimizing module and_gate8.
Optimizing module add_8bit.
Optimizing module add_4bit.
Optimizing module not_gate4.
Optimizing module exor_gate4.
Optimizing module or_gate4.
Optimizing module and_gate4.

yosys> opt

18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module sub_8bit.
Optimizing module dec_8bit.
Optimizing module inc_8bit.
Optimizing module alu8bit.
Optimizing module not_gate8.
Optimizing module exor_gate8.
Optimizing module or_gate8.
Optimizing module and_gate8.
Optimizing module add_8bit.
Optimizing module add_4bit.
Optimizing module not_gate4.
Optimizing module exor_gate4.
Optimizing module or_gate4.
Optimizing module and_gate4.

yosys> opt_merge -nomux

18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 38 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 30 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
<suppressed ~24 debug messages>
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\add_4bit'.
Computing hashes of 36 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Computing hashes of 33 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
<suppressed ~12 debug messages>
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Removed a total of 12 cells.

yosys> opt_muxtree

18.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \sub_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \dec_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \inc_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 2/2 on $mux $procmux$87.
    dead port 1/2 on $mux $procmux$69.
Running muxtree optimizer on module \not_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \add_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \add_4bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 2 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

18.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \sub_8bit.
  Optimizing cells in module \dec_8bit.
  Optimizing cells in module \inc_8bit.
  Optimizing cells in module \alu8bit.
    New ctrl vector for $pmux cell $procmux$73: { $procmux$85_CMP $procmux$84_CMP $procmux$83_CMP }
  Optimizing cells in module \alu8bit.
  Optimizing cells in module \not_gate8.
  Optimizing cells in module \exor_gate8.
  Optimizing cells in module \or_gate8.
  Optimizing cells in module \and_gate8.
  Optimizing cells in module \add_8bit.
  Optimizing cells in module \add_4bit.
  Optimizing cells in module \not_gate4.
  Optimizing cells in module \exor_gate4.
  Optimizing cells in module \or_gate4.
  Optimizing cells in module \and_gate4.
Performed a total of 1 changes.

yosys> opt_merge

18.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 28 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Removed a total of 0 cells.

yosys> opt_dff

18.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

18.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \sub_8bit..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \and_gate4..
Removed 1 unused cells and 64 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

18.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module add_4bit.
Optimizing module add_8bit.
Optimizing module alu8bit.
Optimizing module and_gate4.
Optimizing module and_gate8.
Optimizing module dec_8bit.
Optimizing module exor_gate4.
Optimizing module exor_gate8.
Optimizing module inc_8bit.
Optimizing module not_gate4.
Optimizing module not_gate8.
Optimizing module or_gate4.
Optimizing module or_gate8.
Optimizing module sub_8bit.

18.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

18.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \add_4bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \add_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Running muxtree optimizer on module \and_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \dec_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \inc_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \sub_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

18.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \add_4bit.
  Optimizing cells in module \add_8bit.
  Optimizing cells in module \alu8bit.
  Optimizing cells in module \and_gate4.
  Optimizing cells in module \and_gate8.
  Optimizing cells in module \dec_8bit.
  Optimizing cells in module \exor_gate4.
  Optimizing cells in module \exor_gate8.
  Optimizing cells in module \inc_8bit.
  Optimizing cells in module \not_gate4.
  Optimizing cells in module \not_gate8.
  Optimizing cells in module \or_gate4.
  Optimizing cells in module \or_gate8.
  Optimizing cells in module \sub_8bit.
Performed a total of 0 changes.

yosys> opt_merge

18.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 27 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Removed a total of 0 cells.

yosys> opt_dff

18.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

18.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \and_gate4..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \sub_8bit..

yosys> opt_expr

18.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module add_4bit.
Optimizing module add_8bit.
Optimizing module alu8bit.
Optimizing module and_gate4.
Optimizing module and_gate8.
Optimizing module dec_8bit.
Optimizing module exor_gate4.
Optimizing module exor_gate8.
Optimizing module inc_8bit.
Optimizing module not_gate4.
Optimizing module not_gate8.
Optimizing module or_gate4.
Optimizing module or_gate8.
Optimizing module sub_8bit.

18.16. Finished fast OPT passes. (There is nothing left to do.)

yosys> memory

19. Executing MEMORY pass.

yosys> opt_mem

19.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

19.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

19.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

19.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

19.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

19.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \and_gate4..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \sub_8bit..

yosys> memory_share

19.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

19.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

19.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \and_gate4..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \sub_8bit..

yosys> memory_collect

19.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> memory_map

19.11. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> techmap

20. Executing TECHMAP pass (map to technology primitives).

20.1. Executing Verilog-2005 frontend: /opt/homebrew/bin/../share/yosys/techmap.v
Parsing Verilog input from `/opt/homebrew/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu_brent_kung'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `$__div_mod_u'.
Generating RTLIL representation for module `$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Generating RTLIL representation for module `$connect'.
Generating RTLIL representation for module `$input_port'.
Successfully finished Verilog frontend.

20.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $dlatch.
Using template $paramod$ee721315a7b0169d82611b9aea01747035b97792\_90_pmux for cells of type $pmux.
Using template $paramod$d629d85c8826a74239b9178d1930215a43b0ceb0\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_or.
No more expansions possible.
<suppressed ~202 debug messages>

yosys> opt

21. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

21.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module add_4bit.
Optimizing module add_8bit.
Optimizing module alu8bit.
<suppressed ~16 debug messages>
Optimizing module and_gate4.
Optimizing module and_gate8.
Optimizing module dec_8bit.
Optimizing module exor_gate4.
Optimizing module exor_gate8.
Optimizing module inc_8bit.
Optimizing module not_gate4.
Optimizing module not_gate8.
Optimizing module or_gate4.
Optimizing module or_gate8.
Optimizing module sub_8bit.

yosys> opt_merge -nomux

21.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 185 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 177 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Computing hashes of 176 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
<suppressed ~27 debug messages>
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Removed a total of 9 cells.

yosys> opt_muxtree

21.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \add_4bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \add_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \dec_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \inc_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \sub_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

21.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \add_4bit.
  Optimizing cells in module \add_8bit.
  Optimizing cells in module \alu8bit.
  Optimizing cells in module \and_gate4.
  Optimizing cells in module \and_gate8.
  Optimizing cells in module \dec_8bit.
  Optimizing cells in module \exor_gate4.
  Optimizing cells in module \exor_gate8.
  Optimizing cells in module \inc_8bit.
  Optimizing cells in module \not_gate4.
  Optimizing cells in module \not_gate8.
  Optimizing cells in module \or_gate4.
  Optimizing cells in module \or_gate8.
  Optimizing cells in module \sub_8bit.
Performed a total of 0 changes.

yosys> opt_merge

21.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 176 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Removed a total of 0 cells.

yosys> opt_dff

21.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

21.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \and_gate4..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \sub_8bit..
Removed 0 unused cells and 103 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

21.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module add_4bit.
Optimizing module add_8bit.
Optimizing module alu8bit.
Optimizing module and_gate4.
Optimizing module and_gate8.
Optimizing module dec_8bit.
Optimizing module exor_gate4.
Optimizing module exor_gate8.
Optimizing module inc_8bit.
Optimizing module not_gate4.
Optimizing module not_gate8.
Optimizing module or_gate4.
Optimizing module or_gate8.
Optimizing module sub_8bit.

21.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

21.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \add_4bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \add_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \alu8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \and_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \dec_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \exor_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \inc_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \not_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate4..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \or_gate8..
  Creating internal representation of mux trees.
  No muxes found in this module.
Running muxtree optimizer on module \sub_8bit..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

21.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \add_4bit.
  Optimizing cells in module \add_8bit.
  Optimizing cells in module \alu8bit.
  Optimizing cells in module \and_gate4.
  Optimizing cells in module \and_gate8.
  Optimizing cells in module \dec_8bit.
  Optimizing cells in module \exor_gate4.
  Optimizing cells in module \exor_gate8.
  Optimizing cells in module \inc_8bit.
  Optimizing cells in module \not_gate4.
  Optimizing cells in module \not_gate8.
  Optimizing cells in module \or_gate4.
  Optimizing cells in module \or_gate8.
  Optimizing cells in module \sub_8bit.
Performed a total of 0 changes.

yosys> opt_merge

21.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\add_4bit'.
Computing hashes of 32 cells of `\add_4bit'.
Finding duplicate cells in `\add_4bit'.
Finding identical cells in module `\add_8bit'.
Computing hashes of 2 cells of `\add_8bit'.
Finding duplicate cells in `\add_8bit'.
Finding identical cells in module `\alu8bit'.
Computing hashes of 176 cells of `\alu8bit'.
Finding duplicate cells in `\alu8bit'.
Finding identical cells in module `\and_gate4'.
Computing hashes of 4 cells of `\and_gate4'.
Finding duplicate cells in `\and_gate4'.
Finding identical cells in module `\and_gate8'.
Computing hashes of 2 cells of `\and_gate8'.
Finding duplicate cells in `\and_gate8'.
Finding identical cells in module `\dec_8bit'.
Computing hashes of 1 cells of `\dec_8bit'.
Finding duplicate cells in `\dec_8bit'.
Finding identical cells in module `\exor_gate4'.
Computing hashes of 4 cells of `\exor_gate4'.
Finding duplicate cells in `\exor_gate4'.
Finding identical cells in module `\exor_gate8'.
Computing hashes of 2 cells of `\exor_gate8'.
Finding duplicate cells in `\exor_gate8'.
Finding identical cells in module `\inc_8bit'.
Computing hashes of 1 cells of `\inc_8bit'.
Finding duplicate cells in `\inc_8bit'.
Finding identical cells in module `\not_gate4'.
Computing hashes of 4 cells of `\not_gate4'.
Finding duplicate cells in `\not_gate4'.
Finding identical cells in module `\not_gate8'.
Computing hashes of 2 cells of `\not_gate8'.
Finding duplicate cells in `\not_gate8'.
Finding identical cells in module `\or_gate4'.
Computing hashes of 4 cells of `\or_gate4'.
Finding duplicate cells in `\or_gate4'.
Finding identical cells in module `\or_gate8'.
Computing hashes of 2 cells of `\or_gate8'.
Finding duplicate cells in `\or_gate8'.
Finding identical cells in module `\sub_8bit'.
Computing hashes of 2 cells of `\sub_8bit'.
Finding duplicate cells in `\sub_8bit'.
Removed a total of 0 cells.

yosys> opt_dff

21.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

21.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \add_4bit..
Finding unused cells or wires in module \add_8bit..
Finding unused cells or wires in module \alu8bit..
Finding unused cells or wires in module \and_gate4..
Finding unused cells or wires in module \and_gate8..
Finding unused cells or wires in module \dec_8bit..
Finding unused cells or wires in module \exor_gate4..
Finding unused cells or wires in module \exor_gate8..
Finding unused cells or wires in module \inc_8bit..
Finding unused cells or wires in module \not_gate4..
Finding unused cells or wires in module \not_gate8..
Finding unused cells or wires in module \or_gate4..
Finding unused cells or wires in module \or_gate8..
Finding unused cells or wires in module \sub_8bit..

yosys> opt_expr

21.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module add_4bit.
Optimizing module add_8bit.
Optimizing module alu8bit.
Optimizing module and_gate4.
Optimizing module and_gate8.
Optimizing module dec_8bit.
Optimizing module exor_gate4.
Optimizing module exor_gate8.
Optimizing module inc_8bit.
Optimizing module not_gate4.
Optimizing module not_gate8.
Optimizing module or_gate4.
Optimizing module or_gate8.
Optimizing module sub_8bit.

21.16. Finished fast OPT passes. (There is nothing left to do.)

yosys> clean

yosys> stat

22. Printing statistics.

=== add_4bit ===

        +----------Local Count, excluding submodules.
        | 
       32 wires
       47 wire bits
       10 public wires
       25 public wire bits
        5 ports
       14 port bits
       30 cells
       16   $_AND_
       10   $_OR_
        4   $_XOR_
        2 submodules
        1   and_gate4
        1   exor_gate4

=== add_8bit ===

        +----------Local Count, excluding submodules.
        | 
        6 wires
       27 wire bits
        6 public wires
       27 public wire bits
        5 ports
       26 port bits
        2 submodules
        2   add_4bit

=== alu8bit ===

        +----------Local Count, excluding submodules.
        | 
       65 wires
      257 wire bits
       18 public wires
       98 public wire bits
        6 ports
       30 port bits
      168 cells
       72   $_AND_
        1   $_DLATCH_N_
       26   $_MUX_
        7   $_NOT_
       62   $_OR_
        8 submodules
        1   add_8bit
        1   and_gate8
        1   dec_8bit
        1   exor_gate8
        1   inc_8bit
        1   not_gate8
        1   or_gate8
        1   sub_8bit

=== and_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_AND_

=== and_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   and_gate4

=== dec_8bit ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       17 wire bits
        3 public wires
       17 public wire bits
        3 ports
       17 port bits
        1 submodules
        1   sub_8bit

=== exor_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_XOR_

=== exor_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   exor_gate4

=== inc_8bit ===

        +----------Local Count, excluding submodules.
        | 
        5 wires
       26 wire bits
        5 public wires
       26 public wire bits
        3 ports
       17 port bits
        1 submodules
        1   add_8bit

=== not_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        2 wires
        8 wire bits
        2 public wires
        8 public wire bits
        2 ports
        8 port bits
        4 cells
        4   $_NOT_

=== not_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        2 wires
       16 wire bits
        2 public wires
       16 public wire bits
        2 ports
       16 port bits
        2 submodules
        2   not_gate4

=== or_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_OR_

=== or_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   or_gate4

=== sub_8bit ===

        +----------Local Count, excluding submodules.
        | 
        5 wires
       33 wire bits
        5 public wires
       33 public wire bits
        4 ports
       25 port bits
        2 submodules
        1   add_8bit
        1   not_gate8

=== design hierarchy ===

        +----------Count including submodules.
        | 
      520 alu8bit
       30   add_4bit
        4     and_gate4
        4     exor_gate4
        4   and_gate4
       30       add_4bit
        4         and_gate4
        4         exor_gate4
        4       not_gate4
        4   exor_gate4
       30     add_4bit
        4       and_gate4
        4       exor_gate4
        4   not_gate4
        4   or_gate4
       30     add_4bit
        4       and_gate4
        4       exor_gate4
        4     not_gate4

        +----------Count including submodules.
        | 
      456 wires
     1282 wire bits
      233 public wires
      947 public wire bits
      173 ports
      762 port bits
        - memories
        - memory bits
        - processes
      520 cells
      240   $_AND_
        1   $_DLATCH_N_
       26   $_MUX_
       31   $_NOT_
      150   $_OR_
       72   $_XOR_
        8 submodules
        1   add_8bit
        1   and_gate8
        1   dec_8bit
        1   exor_gate8
        1   inc_8bit
        1   not_gate8
        1   or_gate8
        1   sub_8bit


yosys> hierarchy -check

23. Executing HIERARCHY pass (managing design hierarchy).
Attribute `top' found on module `alu8bit'. Setting top module to alu8bit.

23.1. Analyzing design hierarchy..
Top module:  \alu8bit
Used module:     \add_8bit
Used module:         \add_4bit
Used module:             \and_gate4
Used module:             \exor_gate4
Used module:     \and_gate8
Used module:     \dec_8bit
Used module:         \sub_8bit
Used module:             \not_gate8
Used module:                 \not_gate4
Used module:     \exor_gate8
Used module:     \inc_8bit
Used module:     \or_gate8
Used module:         \or_gate4

23.2. Analyzing design hierarchy..
Top module:  \alu8bit
Used module:     \add_8bit
Used module:         \add_4bit
Used module:             \and_gate4
Used module:             \exor_gate4
Used module:     \and_gate8
Used module:     \dec_8bit
Used module:         \sub_8bit
Used module:             \not_gate8
Used module:                 \not_gate4
Used module:     \exor_gate8
Used module:     \inc_8bit
Used module:     \or_gate8
Used module:         \or_gate4
Removed 0 unused modules.

yosys> stat -top alu8bit

24. Printing statistics.

=== add_4bit ===

        +----------Local Count, excluding submodules.
        | 
       32 wires
       47 wire bits
       10 public wires
       25 public wire bits
        5 ports
       14 port bits
       30 cells
       16   $_AND_
       10   $_OR_
        4   $_XOR_
        2 submodules
        1   and_gate4
        1   exor_gate4

=== add_8bit ===

        +----------Local Count, excluding submodules.
        | 
        6 wires
       27 wire bits
        6 public wires
       27 public wire bits
        5 ports
       26 port bits
        2 submodules
        2   add_4bit

=== alu8bit ===

        +----------Local Count, excluding submodules.
        | 
       65 wires
      257 wire bits
       18 public wires
       98 public wire bits
        6 ports
       30 port bits
      168 cells
       72   $_AND_
        1   $_DLATCH_N_
       26   $_MUX_
        7   $_NOT_
       62   $_OR_
        8 submodules
        1   add_8bit
        1   and_gate8
        1   dec_8bit
        1   exor_gate8
        1   inc_8bit
        1   not_gate8
        1   or_gate8
        1   sub_8bit

=== and_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_AND_

=== and_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   and_gate4

=== dec_8bit ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       17 wire bits
        3 public wires
       17 public wire bits
        3 ports
       17 port bits
        1 submodules
        1   sub_8bit

=== exor_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_XOR_

=== exor_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   exor_gate4

=== inc_8bit ===

        +----------Local Count, excluding submodules.
        | 
        5 wires
       26 wire bits
        5 public wires
       26 public wire bits
        3 ports
       17 port bits
        1 submodules
        1   add_8bit

=== not_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        2 wires
        8 wire bits
        2 public wires
        8 public wire bits
        2 ports
        8 port bits
        4 cells
        4   $_NOT_

=== not_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        2 wires
       16 wire bits
        2 public wires
       16 public wire bits
        2 ports
       16 port bits
        2 submodules
        2   not_gate4

=== or_gate4 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       12 wire bits
        3 public wires
       12 public wire bits
        3 ports
       12 port bits
        4 cells
        4   $_OR_

=== or_gate8 ===

        +----------Local Count, excluding submodules.
        | 
        3 wires
       24 wire bits
        3 public wires
       24 public wire bits
        3 ports
       24 port bits
        2 submodules
        2   or_gate4

=== sub_8bit ===

        +----------Local Count, excluding submodules.
        | 
        5 wires
       33 wire bits
        5 public wires
       33 public wire bits
        4 ports
       25 port bits
        2 submodules
        1   add_8bit
        1   not_gate8

=== design hierarchy ===

        +----------Count including submodules.
        | 
      520 alu8bit
       30   add_4bit
        4     and_gate4
        4     exor_gate4
        4   and_gate4
       30       add_4bit
        4         and_gate4
        4         exor_gate4
        4       not_gate4
        4   exor_gate4
       30     add_4bit
        4       and_gate4
        4       exor_gate4
        4   not_gate4
        4   or_gate4
       30     add_4bit
        4       and_gate4
        4       exor_gate4
        4     not_gate4

        +----------Count including submodules.
        | 
      456 wires
     1282 wire bits
      233 public wires
      947 public wire bits
      173 ports
      762 port bits
        - memories
        - memory bits
        - processes
      520 cells
      240   $_AND_
        1   $_DLATCH_N_
       26   $_MUX_
       31   $_NOT_
      150   $_OR_
       72   $_XOR_
        8 submodules
        1   add_8bit
        1   and_gate8
        1   dec_8bit
        1   exor_gate8
        1   inc_8bit
        1   not_gate8
        1   or_gate8
        1   sub_8bit


yosys> check

25. Executing CHECK pass (checking for obvious problems).
Checking module add_4bit...
Checking module add_8bit...
Checking module alu8bit...
Checking module and_gate4...
Checking module and_gate8...
Checking module dec_8bit...
Checking module exor_gate4...
Checking module exor_gate8...
Checking module inc_8bit...
Checking module not_gate4...
Checking module not_gate8...
Checking module or_gate4...
Checking module or_gate8...
Checking module sub_8bit...
Found and reported 0 problems.

yosys> write_verilog -noattr synth_alu8bit_custom_netlist.v

26. Executing Verilog backend.

yosys> bmuxmap

26.1. Executing BMUXMAP pass.

yosys> demuxmap

26.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\add_4bit'.
Dumping module `\add_8bit'.
Dumping module `\alu8bit'.
Dumping module `\and_gate4'.
Dumping module `\and_gate8'.
Dumping module `\dec_8bit'.
Dumping module `\exor_gate4'.
Dumping module `\exor_gate8'.
Dumping module `\inc_8bit'.
Dumping module `\not_gate4'.
Dumping module `\not_gate8'.
Dumping module `\or_gate4'.
Dumping module `\or_gate8'.
Dumping module `\sub_8bit'.

yosys> write_json synth_alu8bit_custom.json

27. Executing JSON backend.

yosys> show -format dot -prefix synth_alu8bit_custom_diagram -notitle

28. Generating Graphviz representation of design.
Writing dot description to `synth_alu8bit_custom_diagram.dot'.
Dumping module add_4bit to page 1.
Dumping module add_8bit to page 2.
Dumping module alu8bit to page 3.
Dumping module and_gate4 to page 4.
Dumping module and_gate8 to page 5.
Dumping module dec_8bit to page 6.
Dumping module exor_gate4 to page 7.
Dumping module exor_gate8 to page 8.
Dumping module inc_8bit to page 9.
Dumping module not_gate4 to page 10.
Dumping module not_gate8 to page 11.
Dumping module or_gate4 to page 12.
Dumping module or_gate8 to page 13.
Dumping module sub_8bit to page 14.

yosys> echo ""

Syntax error in command `echo ""':

    echo on

Print all commands to log before executing them.


    echo off

Do not print all commands to log before executing them. (default)

ERROR: Command syntax error: Unexpected argument.
> echo ""
>      ^
